// Строка с максимальной суммой элементов
#include <stdio.h>
#include <conio.h>

#define N 3  // размер квадратной матрицы

void main()
{
    int m[N][N+1]; // последний столбец используем
                   // для хранения суммы эл-тов строки
    int max;       // строка, с максимальной суммой
                   // элементов
    int i,j;       // индексы

    puts("\nОпределение строки с максимальной");
    puts("суммой элементов");
    printf("Введите матрицу %ix%i\n", N, N);
    for (i = 0; i < N; i++)
    {
        printf("Элементы %i-й строки -> ", i+1);
        for (j = 0; j < N; j++)
            scanf("%i", &m[i][j]);
    }

    // для каждой строки вычислим сумму эл-тов
    for (i = 0; i < N; i++)
    {
        m[i][N] = 0;
        for(j = 0; j < N; j++)
           m[i][N] += m[i][j];
    }

    // найдем строку с максимальной суммой
    max = 0;
    for (i = 1; i < N; i++)
        if ( m[i][N] > m[max][N] )
           max = i;

    printf("\nВ %i-й строке сумма элементов", max+1);
    printf("максимальна и равна %i\n", m[max][N]);

    printf("\nДля завершения нажмите <Enter>\n");

    getch();
}

