// Таблица функции
#include <stdio.h>
#include <conio.h>

#define  LB -2.0  // нижняя граница диапазона изменения аргумента
#define  HB  2.0 // верхняя граница диапазона изменения аргумента
#define  DX  0.5 // приращение аргумента

void main()
{
    float x,y;  // аргумент и значение функции
    int n;      // кол-во точек
    int i;      // счетчик циклов

    n = (HB - LB)/DX +1;
    x = LB;
    printf("------------------\n");
    printf("   x    |   y\n");
    printf("------------------\n");
    for (i = 1; i<=n; i++)
    {
       y = -2.4*x*x+5*x-3;
       printf("%6.2f  | %6.2f\n" ,x ,y);
       x += DX;
    }
    printf("------------------\n");

    printf("\nДля завершения нажмите <Enter>");
    getch();
}

